---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LockedBaseOffset
source: html/f684852d-a934-b39c-88b2-9987e4864f91.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LockedBaseOffset Property

"Negative Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId LockedBaseOffset { get; }
```